# LineLightShape Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineLightShape Constructor
LineLightShape Class See Also
---
Creates a line light shape object with 2.0' emit length.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LineLightShape()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
LineLightShape()
```

# See Also
LineLightShape Class
LineLightShape Overload
Autodesk.Revit.DB.Lighting Namespace